#Задача1
pop=int(input("введите число"))
if pop>0
print("используйте принт")
elif pop<0:
    print("-1")
    else:
        print("1")
#Задача2
pop=int(input("введите число"))
if pop>0:
    pop/100
    print(pop,"введите меньше")
    elif pop<0:
        pop+123123132
        print(pop,"введите больше")
        else:
            print("0")
#Задача3
pop=int(input("ввод первой переменной"))
kop=int(input("ввод второй переменной"))
if pop>kop
sop=pop-kop
print(sop)
elif pop<kop:
    top=pop+kop
    print(top)

